      TMUX 
      
$tmux

$tmux new -s (name-session)

$tmux ls

$tmux attach

$tmux attach -t (name-session)

$tmux kill-session -t (name-session)

$tmux kill-server

$tmux list-commands

$man tmux 

~/.tmux.conf  (файл конфигурации)

$tmux source-file ~/.tmux.conf




Prefix = ctrl + space

P = Prefix

alt + jk    (окны переход)

ctrl + hjkl  (панелы переход)

P + alt + hjkl  (изменить размер панелов)

P + ctrl + hjkl (изменить размер панелов)



P + [  (вход в режим копирования)
/      (поиск в режиме копирования)
v      (для начала копирования)
y      (копирования)
hjkl   (движения)
esc, q (выйти из режима копирования)



P + c  (новое окно)

P + w  (список окон)

P + n  (следующее окно)

P + p  (предыдущее окно)

P + "  (деление окна горизонтально)

P + %  (деление окно вертикално)

P + &  (закрыть окно)

P + x  (закрытие панелов,окон)

P + d  (отключение от сессии)

P + s  (выбрать сессии)

P + ;  (переключиться между текущей и предыдущей панелью)

P + !  (превратить панели в самостоятельное окно)

P + f  (поиск текста в открытых окнах)

P + {  (поменять местами текущую и предыдущую панели)

P + }  (поменять местами текущую и следущую панели)

P + ?  (показать все привязки клавиши)

P + :  (командная строка tmux)





